In [3]:
import boto3
import configparser

In [4]:
#### Sample Files Path
"key='log-data/2018/11/2018-11-01-events.json'"
"key='song-data/A/A/A/TRAAAAK128F9318786.json'"
"key='log_json_path.json'"

"key='log_json_path.json'"

In [6]:
s3_song_data = 's3://udacity-dend/song_data'
s3_log_data = 's3://udacity-dend/log_data'
s3_json_log_data = 's3://udacity-dend/log_json_path.json'


config = configparser.ConfigParser()

config.read_file(open('dwh.cfg'))

ACCESS_KEY_ID = config.get('aws_credentials','access_key_id')
SECRET_ACCESS_KEY = config.get('aws_credentials','secret_access_key')

REDSHIFT_ROLE_NAME = config.get('cluster_settings','redshift_role_name')
CLUSTER_TYPE = config.get('cluster_settings','cluster_type')
NUMBER_OF_NODES = config.get('cluster_settings','number_of_nodes')
NODE_TYPE = config.get('cluster_settings','node_type')
CLUSTER_IDENTIFIER = config.get('cluster_settings','cluster_identifier')
DB_NAME = config.get('cluster_settings','db_name')
MASTER_USER_NAME = config.get('cluster_settings','master_user_name')
MASTER_USER_PASSWORD = config.get('cluster_settings','master_user_password')
PORT = config.get('cluster_settings','port')
ENDPOINT = config.get('cluster_settings','endpoint')

In [4]:

s3 = boto3.resource(
     's3'
    ,region_name='us-west-2'
    ,aws_access_key_id=ACCESS_KEY_ID
    ,aws_secret_access_key=SECRET_ACCESS_KEY
)

In [18]:
# Sample File Download 
sampleBucket.download_file('log-data/2018/11/2018-11-01-events.json','./2018-11-01-events.json')
sampleBucket.download_file('song-data/A/A/A/TRAAAAK128F9318786.json','./TRAAAAK128F9318786.json')
sampleBucket.download_file('log_json_path.json','./log_json_path.json')

In [ ]:

sampleBucket = s3.Bucket("udacity-dend")

for obj in sampleBucket.objects.all():
    
    if 
    print(obj)

In [5]:

%load_ext sql

conn_string = f'postgresql://{MASTER_USER_NAME}:{MASTER_USER_PASSWORD}@{ENDPOINT}:{PORT}/{DB_NAME}'
        
%sql $conn_string

'Connected: sparkify@sparkify_dw'

In [35]:
%%sql
SELECT
     ts
    ,ts + interval '1 second'
    ,TIMESTAMP 'epoch'
    ,ts/1000 AS ts_divided
    --,TO_TIMESTAMP(TRUNC((ts / 1000)::FLOAT8))
    --TIMESTAMP 'epoch' + ts/1000 *INTERVAL '1 second' as start_time
    ,TIMESTAMP 'epoch' + ts/1000 * interval '1 second' AS test
    
FROM
    staging.events
LIMIT
    3

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
3 rows affected.

[(1541105830796, '154110583079600:00:01', datetime.datetime(1970, 1, 1, 0, 0), 1541105830, datetime.datetime(2018, 11, 1, 20, 57, 10)),
 (1541106106796, '154110610679600:00:01', datetime.datetime(1970, 1, 1, 0, 0), 1541106106, datetime.datetime(2018, 11, 1, 21, 1, 46)),
 (1541106106796, '154110610679600:00:01', datetime.datetime(1970, 1, 1, 0, 0), 1541106106, datetime.datetime(2018, 11, 1, 21, 1, 46))]

In [28]:
%%sql

SELECT
     COALESCE(artist_id,'Unkown') AS artist_id
    ,COALESCE(artist_name,'Unknwon') AS name
    ,COALESCE(artist_location,'Unkown') AS location
    ,COALESCE(artist_latitude,9999999.99) AS latitude
    ,COALESCE(artist_longitude,9999999.99) AS longitude
FROM
    staging.songs

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
1 rows affected.

[('ARJNIUY12298900C91', 'Adelitas Way', '', 9999999.99, 9999999.99)]

#### dim_songs

In [63]:
%%sql
INSERT INTO public.dim_songs (
     song_id
    ,title
    ,artist_id
    ,year
    ,duration
)

SELECT DISTINCT
     COALESCE(stage_songs.song_id,'Unknown') AS song_id
    ,COALESCE(stage_songs.title,'Unkown') AS title
    ,COALESCE(stage_songs.artist_id,'Unknown') AS artist_id
    ,COALESCE(stage_songs.year,9999) AS year
    ,COALESCE(stage_songs.duration,9999999.99) AS duration
FROM
    staging.songs AS stage_songs
LEFT JOIN
    public.dim_songs AS dim_songs
ON
    stage_songs.song_id = dim_songs.song_id
AND
    dim_songs.title IS NULL
;

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
1 rows affected.

[]

#### dim_artists

In [65]:
%%sql
INSERT INTO public.dim_artists(
     artist_id
    ,name
    ,location
    ,latitude
    ,longitude
)

SELECT DISTINCT
     COALESCE(stage_songs.artist_id,'Unkown') AS artist_id
    ,COALESCE(stage_songs.artist_name,'Unknwon') AS name
    ,COALESCE(stage_songs.artist_location,'Unkown') AS location
    ,COALESCE(stage_songs.artist_latitude,9999999.99) AS latitude
    ,COALESCE(stage_songs.artist_longitude,9999999.99) AS longitude
FROM
    staging.songs AS stage_songs
LEFT JOIN
    public.dim_artists AS dim_artists
ON
    stage_songs.artist_id = dim_artists.artist_id
WHERE
    dim_artists.name IS NULL
;

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
0 rows affected.

[]

#### dim_users

In [45]:
%%sql
INSERT INTO public.dim_users(
     user_id
    ,first_name
    ,last_name
    ,gender
    ,level
)

SELECT DISTINCT
     events.user_id::INTEGER AS user_id
    ,events.first_name
    ,events.last_name
    ,events.gender
    ,events.level
FROM
    staging.events AS events
LEFT JOIN
    public.dim_users AS dim_user
ON
    events.user_id::INTEGER = dim_user.user_id
WHERE
    dim_user.user_id IS NULL
;

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
5 rows affected.

[]

In [46]:
%%sql
SELECT * FROM public.dim_users

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
5 rows affected.

[(8, 'Kaylee', 'Summers', 'F', 'free'),
 (10, 'Sylvie', 'Cruz', 'F', 'free'),
 (101, 'Jayden', 'Fox', 'M', 'free'),
 (39, 'Walter', 'Frye', 'M', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [41]:
%%sql
TRUNCATE TABLE public.dim_users

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
Done.

[]

#### dim_time

In [66]:
%%sql
INSERT INTO public.dim_time(
     start_time
    ,hour
    ,day
    ,week
    ,month
    ,year
    ,weekday
)

/*----------------------------------------------------------
    A CTE is used to fetch unique values of Unix Epoch
and convert them to proper Timestamp format.
----------------------------------------------------------*/
WITH cte_unique_timestamps AS (
    SELECT DISTINCT
        TIMESTAMP 'epoch' + ts/1000 * interval '1 second' AS timestamp
    FROM
        staging.events
)

SELECT
     cte.timestamp AS start_time
    ,EXTRACT(HOUR FROM cte.timestamp) AS hour
    ,EXTRACT(DAY FROM cte.timestamp) AS day
    ,EXTRACT(WEEK FROM cte.timestamp) AS week
    ,EXTRACT(MONTH FROM cte.timestamp) AS month
    ,EXTRACT(YEAR FROM cte.timestamp) AS year
    ,EXTRACT(DOW FROM cte.timestamp) AS weekday
FROM
    cte_unique_timestamps AS cte
LEFT JOIN
    public.dim_time AS dim_time
ON
    cte.timestamp = dim_time.start_time
WHERE
    dim_time.hour IS NULL
;

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
0 rows affected.

[]

In [71]:
%%sql
SELECT
    *
FROM
    public.dim_users

 * postgresql://sparkify:***@dwhcluster.cnoetczdeddb.us-west-2.redshift.amazonaws.com:5439/sparkify_dw
5 rows affected.

[(39, 'Walter', 'Frye', 'M', 'free'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (10, 'Sylvie', 'Cruz', 'F', 'free'),
 (101, 'Jayden', 'Fox', 'M', 'free')]